<?php
return array (
	'hot_search_keywords' => 
	  array (
		0 => '轩辕剑之天之痕',
		1 => '爱情公寓3',
		2 => '画皮2',
		3 => '甄嬛传',
		4 => 'AA制生活',
		5 => '夫妻那些事',
		6 => '北京爱情故事',
		7 => '龙门飞甲',
	),
	'search_index' => array(
		'1' => array('动作','冒险','喜剧','爱情','科幻','恐怖','战争','灾难','犯罪','悬疑','奇幻','武侠','家庭','记录','剧情','伦理','高清'),
		'2' => array('剧情','偶像','情感','伦理','喜剧','古装','奇幻','犯罪','战争','动作','悬疑','武侠','TVB','其他'),
		'3' => array('新番','少儿','热血','搞笑','少女','萝莉','动作','机战','推理','竞技','魔幻','冒险','社会','校园','情感','剧情','剧场版'),
		'years' => array('2012','2011','2010','2009','2008','2007','2006','2005','2004','2003','2002','2001','2000','其他'),
		'areas' => array('大陆','香港','台湾','韩国','日本','泰国','欧美','其他')
	),
 
	'tv_sys' => array (
		'hntv' => '',
		'jstv' => '',
		'bjtv' => '',
		'dftv' => '',
	),
	'will_show_movies' => '',
	'register' => array (
		'forbin_ips' => '',
		'forbin_usernames' => '',
		'forbin_email' => '',
	)
);